openfoam_case/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: Viscosidad Turbulenta (νt)            |
\*---------------------------------------------------------------------------*/

// ============================================================
// VISCOSIDAD TURBULENTA — νt (nut) [m²/s]
// ============================================================
// En el modelo k-ε, la viscosidad turbulenta se calcula como:
//
//   νt = Cμ * k² / ε
//
// donde Cμ = 0.09 (constante empírica del modelo k-ε de Launder-Spalding)
//
// νt representa el efecto de las fluctuaciones turbulentas sobre
// el transporte de momento. El esfuerzo de Reynolds se modela como:
//
//   -<u'v'> = νt * (∂U/∂y + ∂V/∂x)   (Hipótesis de Boussinesq)
//
// Relación con el número de Reynolds:
//   Re_t = k² / (ν * ε)    (Reynolds turbulento)
// ============================================================

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    top
    {
        type            calculated;
        value           uniform 0;
    }

    side
    {
        type            calculated;
        value           uniform 0;
    }

    axis
    {
        type            empty;
    }
}
