openfoam_case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: Configuración de Solvers — fvSolution |
\*---------------------------------------------------------------------------*/

// ============================================================
// SOLVERS Y ALGORITMOS — fvSolution
// ============================================================
// Define los solvers lineales para cada campo, y el algoritmo
// de acoplamiento presión-velocidad (PIMPLE).
//
// PIMPLE = PISO + SIMPLE:
//   - PISO: Pressure Implicit with Splitting of Operator
//   - SIMPLE: Semi-Implicit Method for Pressure-Linked Equations
//
// PIMPLE permite grandes pasos de tiempo (Co > 1) con estabilidad
// gracias a las iteraciones externas (nOuterCorrectors)
// ============================================================

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    // --------------------------------------------------------
    // Solver de PRESIÓN — Ecuación de Poisson: ∇²p = ∇·u/Δt
    // GAMG: Geometric Agglomerated Algebraic Multigrid
    // Más eficiente que PCG para mallas grandes
    // --------------------------------------------------------
    p
    {
        solver          GAMG;
        tolerance       1e-07;      // Tolerancia absoluta
        relTol          0.01;       // Tolerancia relativa
        smoother        GaussSeidel;
        nCellsInCoarsestLevel 10;
        cacheAgglomeration true;
        nPreSweeps      0;
        nPostSweeps     2;
        mergeLevels     1;
    }

    // Presión corregida (solver pimpleFoam)
    pFinal
    {
        $p;
        relTol          0;  // Última iteración: sin tolerancia relativa
    }

    // --------------------------------------------------------
    // Solver de VELOCIDAD
    // PBiCGStab: Preconditioned BiConjugate Gradient Stabilized
    // DILU: Diagonal Incomplete LU (precondicionador eficiente)
    // --------------------------------------------------------
    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0.1;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    // Energía cinética turbulenta k
    k
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0.1;
    }

    kFinal
    {
        $k;
        relTol          0;
    }

    // Tasa de disipación ε
    epsilon
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0.1;
    }

    epsilonFinal
    {
        $epsilon;
        relTol          0;
    }
}

// ============================================================
// ALGORITMO PIMPLE — Acoplamiento Presión-Velocidad
// ============================================================
// El flujo incompresible requiere que ∇·u = 0 (divergencia nula)
// PIMPLE resuelve iterativamente:
//   1. Predecir U con presión actual
//   2. Resolver ecuación de presión (Poisson)
//   3. Corregir U para satisfacer ∇·u = 0
//   4. Repetir (nCorrectors veces)
PIMPLE
{
    // Iteraciones externas del algoritmo PIMPLE
    // Mayor número → más estabilidad, mayor costo computacional
    nOuterCorrectors    3;

    // Iteraciones internas de corrección de presión (PISO)
    nCorrectors         2;

    // Correcciones de no-ortogonalidad de malla
    nNonOrthogonalCorrectors 1;

    // Criterio de convergencia para las iteraciones externas
    residualControl
    {
        U
        {
            tolerance   1e-4;
            relTol      0;
        }
        p
        {
            tolerance   1e-4;
            relTol      0;
        }
    }
}

// Relajación para la fase SIMPLE del algoritmo
relaxationFactors
{
    fields
    {
        // Sin relajación en el campo p (PIMPLE no lo necesita)
    }
    equations
    {
        U               1;    // Sin sub-relajación en transitorio
        UFinal          1;
        k               1;
        kFinal          1;
        epsilon         1;
        epsilonFinal    1;
    }
}
